'''
练习一

文件内容如下：（标题为姓名、性别、年龄、薪资）
    albert male 18 3000
    james male 38 30000
    林志玲 female 28 20000
    新桓结衣 female 28 10000
要求从文件中取出每一条记录放入列表中，列表的每个元素都是如下格式：
    {'name':'albert', 'sex':'male', 'age':18, 'salary':3000}

'''



'''
练习二

根据练习一得到的列表，取出薪资最高的人的信息

'''



'''
练习三

根据练习一得到的列表，取出最年轻的人的信息

'''



'''
练习四

根据练习一得到的列表，将每个人的信息中的名字映射成首字母大写的形式

'''



'''
练习五

根据练习一得到的列表，过滤掉名字以a开头的人的信息

'''


'''
练习六

使用递归打印斐波那契数列（0、1、1、2、3、5、8、13...）

'''


'''
练习七

使用random模块写一个随机生成8位验证码的程序，验证码中有随机大小写字母和数字

'''




'''
练习八

写一个模拟撞库的程序，假如密码都是用md5加密的，没有加盐，
撞库就是用多个猜测的密码尝试比对正确的密码，
比对过程一定是用md5来进行

'''


'''
练习九

使用re模块写一个验证手机号是否有效的程序：
首先准备一个通讯录文件：（员工联系方式.txt）
    姓名 地区 身高 体重 电话
    矿用米 北京 171 48 11151054608
    王欣妍 上海 169 46 13813234424
    马闲鱼 深圳 173 50 137234523
    乔苏菲 广州 172 52 15823423525
    罗蒙住 北京 175 49 38623423421
    刘娜汗 北京 170 48 22623423765
    岳妮妮 深圳 177 54 18835324553
    喝完选 深圳 174 52 10933434452
    叶梓萱 上海 171 49 16742432324
    杜珊珊 北京 167 49 13324523342
我们按照中国大陆的手机号标准来对比验证，输出有效的号码

'''





